GopalSaraf/Practicals/PSDL/include/pic18_chip_select.inc
// Version 2.41
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18_CHIP_SELECT_INC_
#define _PIC18_CHIP_SELECT_INC_

#define _HEADER_NOT_FOUND

#ifdef _18C242
#include <pic18c242.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18C252
#include <pic18c252.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18C442
#include <pic18c442.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18C452
#include <pic18c452.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18C601
#include <pic18c601.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18C658
#include <pic18c658.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18C801
#include <pic18c801.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18C858
#include <pic18c858.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F04Q40
#include <pic18f04q40.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F04Q41
#include <pic18f04q41.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F05Q40
#include <pic18f05q40.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F05Q41
#include <pic18f05q41.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F06Q40
#include <pic18f06q40.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F06Q41
#include <pic18f06q41.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F1220
#include <pic18f1220.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F1230
#include <pic18f1230.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F1320
#include <pic18f1320.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F1330
#include <pic18f1330.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F13K22
#include <pic18f13k22.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F13K50
#include <pic18f13k50.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F14K22
#include <pic18f14k22.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F14K22LIN
#include <pic18f14k22lin.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F14K50
#include <pic18f14k50.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F14Q40
#include <pic18f14q40.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F14Q41
#include <pic18f14q41.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F15Q40
#include <pic18f15q40.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F15Q41
#include <pic18f15q41.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F16Q40
#include <pic18f16q40.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F16Q41
#include <pic18f16q41.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2220
#include <pic18f2220.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2221
#include <pic18f2221.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2320
#include <pic18f2320.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2321
#include <pic18f2321.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2331
#include <pic18f2331.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F23K20
#include <pic18f23k20.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F23K22
#include <pic18f23k22.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2410
#include <pic18f2410.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F242
#include <pic18f242.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2420
#include <pic18f2420.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2423
#include <pic18f2423.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2431
#include <pic18f2431.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2439
#include <pic18f2439.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2450
#include <pic18f2450.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2455
#include <pic18f2455.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2458
#include <pic18f2458.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F248
#include <pic18f248.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2480
#include <pic18f2480.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F24J10
#include <pic18f24j10.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F24J11
#include <pic18f24j11.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F24J50
#include <pic18f24j50.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F24K20
#include <pic18f24k20.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F24K22
#include <pic18f24k22.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F24K40
#include <pic18f24k40.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F24K42
#include <pic18f24k42.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F24K50
#include <pic18f24k50.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F24Q10
#include <pic18f24q10.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2510
#include <pic18f2510.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18F2515
#include <pic18f2515.inc>
#undef _HEADER_NOT_FOUND
#endif

