GopalSaraf/Practicals/PSDL/include/pic18_chip_select.inc
#ifdef _18LF6720
#include <pic18lf6720.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF6722
#include <pic18lf6722.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF6723
#include <pic18lf6723.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF67K40
#include <pic18lf67k40.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8310
#include <pic18lf8310.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8390
#include <pic18lf8390.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8393
#include <pic18lf8393.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8410
#include <pic18lf8410.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8490
#include <pic18lf8490.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8493
#include <pic18lf8493.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8520
#include <pic18lf8520.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8525
#include <pic18lf8525.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8527
#include <pic18lf8527.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8585
#include <pic18lf8585.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8620
#include <pic18lf8620.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8621
#include <pic18lf8621.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8622
#include <pic18lf8622.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8627
#include <pic18lf8627.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8628
#include <pic18lf8628.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8680
#include <pic18lf8680.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8720
#include <pic18lf8720.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8722
#include <pic18lf8722.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _18LF8723
#include <pic18lf8723.inc>
#undef _HEADER_NOT_FOUND
#endif

#ifdef _TEST_CHIP_
#undef _HEADER_NOT_FOUND
#endif

#ifdef _HEADER_NOT_FOUND
#error Device-specific header could not be found for target chip
#endif

#endif // _PIC18_CHIP_SELECT_INC_
